In [1]:
import pandas as pd

In [2]:
df = pd.DataFrame({'name' : ['김지훈', '이유진', '박동현', '김민지'],
                  'english' : [90, 80, 60, 70],
                  'math' : [50, 60, 100, 20]})

In [3]:
df

  name  english  math
0  김지훈       90    50
1  이유진       80    60
2  박동현       60   100
3  김민지       70    20

In [4]:
df['english']

0    90
1    80
2    60
3    70
Name: english, dtype: int64

In [5]:
sum(df['english'])

300

In [6]:
sum(df['math'])/4

57.5

In [7]:
sum(df['math'])/len(df)

57.5

In [8]:
#4장 문제

In [10]:
fruit_df = pd.DataFrame({'제품' : ['사과', '딸기', '수박'],
                         '가격' : [1800, 1500, 3000],
                         '판매량' : [24, 38, 13]})

In [11]:
fruit_df

   제품    가격  판매량
0  사과  1800   24
1  딸기  1500   38
2  수박  3000   13

In [12]:
price_avg = sum(fruit_df['가격'])/len(fruit_df)

In [13]:
sales_rate = sum(fruit_df['판매량'])/len(fruit_df)

In [15]:
print(f'과일 가격 평균 : {price_avg}, 과일 판매량 평균 : {sales_rate}')

과일 가격 평균 : 2100.0, 과일 판매량 평균 : 25.0